src/Reports/ОтчетПоЛьготнойОчередиЛинеек/ОтчетПоЛьготнойОчередиЛинеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоЛьготнойОчередиЛинеек</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ЛьготнаяОчередь/ЛьготнаяОчередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛьготнаяОчередь</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчетПоЛьготнойОчередиЛинеек/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ТаблицаЛО = Новый ТаблицаЗначений;

//Макет = Отчеты.ОтчетПоЛьготнойОчередиНаЛинейках.ПолучитьМакет("Макет"); 
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.Период.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.Период.ДатаОкончания;
ТабДок.Вывести(ОблШапка);
	
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.Период,
	|	ЛьготнаяОчередь.ПЗ,
	|	ЛьготнаяОчередь.ПЗ.Дата КАК ДатаСоздания,
	|	ЛьготнаяОчередь.Линейка,
	|	ЛьготнаяОчередь.Изделие,
	|	ЛьготнаяОчередь.НормаРасходов.Элемент КАК МПЗ,
	|	ЛьготнаяОчередь.ДатаОкончания
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.Период МЕЖДУ &ДатаНач И &ДатаКон";
	Если СписокЛинеек.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ЛьготнаяОчередь.Линейка В(&СписокЛинеек)";
	Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);	
	КонецЕсли;
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));	
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));	
РезультатЗапроса = Запрос.Выполнить();
ТаблицаЛО = РезультатЗапроса.Выгрузить();
ТаблицаЛО.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
ТаблицаЛО.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(14,3)));
ТаблицаЛО.Колонки.Добавить("НаименованиеИзделия",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(50)));
	Для каждого ТЧ Из ТаблицаЛО Цикл
	ТЧ.НаименованиеИзделия = глНаименованиеВСкобкахБезЭтапа(ТЧ.Изделие);
		Если ТипЗнч(ТЧ.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТЧ.Подразделение = ТЧ.МПЗ.Канбан.Подразделение;
		Иначе
		ТЧ.Подразделение = Справочники.Подразделения.НайтиПоКоду("32");
		КонецЕсли;
	ТЧ.Количество = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТЧ.Период,ТЧ.ПЗ.ДокументОснование);	
	КонецЦикла;
		Если ПлюсНеВышедшиеИзЛОНачинаяС Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЛьготнаяОчередь.Период,
			|	ЛьготнаяОчередь.ПЗ,
			|	ЛьготнаяОчередь.ПЗ.Дата КАК ДатаСоздания,
			|	ЛьготнаяОчередь.Линейка,
			|	ЛьготнаяОчередь.Изделие,
			|	ЛьготнаяОчередь.НормаРасходов.Элемент КАК МПЗ,
			|	ЛьготнаяОчередь.ДатаОкончания
			|ИЗ
			|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
			|ГДЕ
			|	ЛьготнаяОчередь.Период МЕЖДУ &ДатаНач И &ДатаКон
			|	И ЛьготнаяОчередь.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
			Если СписокЛинеек.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И ЛьготнаяОчередь.Линейка В(&СписокЛинеек)";
			Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);	
			КонецЕсли;
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаНевышедших));	
		Запрос.УстановитьПараметр("ДатаКон",НачалоДня(Отчет.Период.ДатаНачала)-1);		
		Результат = Запрос.Выполнить();
		ВыборкаЛО = Результат.Выбрать();
			Пока ВыборкаЛО.Следующий() Цикл
			ТЧ = ТаблицаЛО.Добавить();
			ТЧ.ПЗ = ВыборкаЛО.ПЗ;
			ТЧ.ДатаСоздания = ВыборкаЛО.ДатаСоздания;
			ТЧ.Линейка = ВыборкаЛО.Линейка;
			ТЧ.Изделие = ВыборкаЛО.Изделие;
			ТЧ.МПЗ = ВыборкаЛО.МПЗ;
			ТЧ.Период = ВыборкаЛО.Период;
			ТЧ.НаименованиеИзделия = глНаименованиеВСкобкахБезЭтапа(ВыборкаЛО.Изделие);
				Если ТипЗнч(ВыборкаЛО.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
				ТЧ.Подразделение = ВыборкаЛО.МПЗ.Канбан.Подразделение;
				Иначе
				ТЧ.Подразделение = Справочники.Подразделения.НайтиПоКоду("32");
				КонецЕсли;
			ТЧ.Количество = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ВыборкаЛО.Период,ВыборкаЛО.ПЗ.ДокументОснование);
			ТЧ.ДатаОкончания = ВыборкаЛО.ДатаОкончания;
			КонецЦикла;
		КонецЕсли; 
//ТаблицаЛО.Свернуть("Линейка,Изделие,НаименованиеИзделия,МПЗ,Подразделение,ПЗ,ДатаЛО","Количество");
	Если СортироватьПо = 1 Тогда
	ТаблицаЛО.Сортировать("МПЗ,НаименованиеИзделия,Изделие,Линейка,Подразделение,ПЗ");	
	ИначеЕсли СортироватьПо = 2 Тогда
	ТаблицаЛО.Сортировать("НаименованиеИзделия,Изделие,Линейка,МПЗ,Подразделение,ПЗ");
	ИначеЕсли СортироватьПо = 3 Тогда
	ТаблицаЛО.Сортировать("Линейка,МПЗ,НаименованиеИзделия,Изделие,Подразделение,ПЗ");
	ИначеЕсли СортироватьПо = 4 Тогда
	ТаблицаЛО.Сортировать("Подразделение,Линейка,НаименованиеИзделия,Изделие,МПЗ,ПЗ");
	ИначеЕсли СортироватьПо = 5 Тогда
	ТаблицаЛО.Сортировать("ДатаСоздания,МПЗ");
	ИначеЕсли СортироватьПо = 6 Тогда
	ТаблицаЛО.Сортировать("Период");
	ИначеЕсли СортироватьПо = 7 Тогда
	ТаблицаЛО.Сортировать("ДатаОкончания");
	КонецЕсли; 
		Для каждого ТЧ Из ТаблицаЛО Цикл 
			Если СписокПодразделений.Количество() > 0 Тогда
				Если СписокПодразделений.НайтиПоЗначению(ТЧ.Подразделение) = Неопределено Тогда
				Продолжить;
				КонецЕсли; 
			КонецЕсли; 
		ОблСтрока.Параметры.Линейка = ТЧ.Линейка;
		ОблСтрока.Параметры.НаименованиеМПЗ = СокрЛП(ТЧ.МПЗ.Наименование);
		ОблСтрока.Параметры.МПЗ = ТЧ.МПЗ;
		ОблСтрока.Параметры.НомерПЗ = ТЧ.ПЗ.Номер;
		ОблСтрока.Параметры.ПЗ = ТЧ.ПЗ;
		ОблСтрока.Параметры.ДатаПостановки = ТЧ.Период; 
		ОблСтрока.Параметры.ДатаОкончания = ТЧ.ДатаОкончания;
		ОблСтрока.Параметры.НаименованиеИзделия = ТЧ.НаименованиеИзделия;
		ОблСтрока.Параметры.Изделие = ТЧ.Изделие;
		ОблСтрока.Параметры.КолНезав = ТЧ.Количество;
		ОблСтрока.Параметры.Подразделение = ТЧ.Подразделение;
		ЯчейкиКомплектации = ОбщийМодульРаботаСРегистрами.ПолучитьЯчейкуКомплектации(ТЧ.Линейка,ТЧ.МПЗ);
		ОблСтрока.Параметры.КолЯчеек = ЯчейкиКомплектации.КоличествоЯчеек;
		ОблСтрока.Параметры.КолВЯчейке = ЯчейкиКомплектации.КоличествоВЯчейке;	
		ТабДок.Вывести(ОблСтрока);
		КонецЦикла;	
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 4;
КонецПроцедуры

&НаСервере
Процедура СформироватьБезРазбивкиПоЛинейкамНаСервере()
ТабДок.Очистить();

ТаблицаЛО = Новый ТаблицаЗначений;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет2");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.Период.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.Период.ДатаОкончания;
ТабДок.Вывести(ОблШапка);
	
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.Период,
	|	ЛьготнаяОчередь.ПЗ,
	|	ЛьготнаяОчередь.ПЗ.Дата КАК ДатаСоздания,
	|	ЛьготнаяОчередь.Линейка,
	|	ЛьготнаяОчередь.Изделие,
	|	ЛьготнаяОчередь.НормаРасходов.Элемент КАК МПЗ,
	|	ЛьготнаяОчередь.ДатаОкончания
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.Период МЕЖДУ &ДатаНач И &ДатаКон";
	Если СписокЛинеек.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ЛьготнаяОчередь.Линейка В(&СписокЛинеек)";
	Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);	
	КонецЕсли;
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));	
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));	
РезультатЗапроса = Запрос.Выполнить();
ТаблицаЛО = РезультатЗапроса.Выгрузить();
ТаблицаЛО.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
ТаблицаЛО.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(14,3)));
ТаблицаЛО.Колонки.Добавить("НаименованиеИзделия",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(50)));
	Для каждого ТЧ Из ТаблицаЛО Цикл
	ТЧ.НаименованиеИзделия = глНаименованиеВСкобкахБезЭтапа(ТЧ.Изделие);
		Если ТипЗнч(ТЧ.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТЧ.Подразделение = ТЧ.МПЗ.Канбан.Подразделение;
		Иначе
		ТЧ.Подразделение = Справочники.Подразделения.НайтиПоКоду("32");
		КонецЕсли;
	ТЧ.Количество = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТЧ.Период,ТЧ.ПЗ.ДокументОснование);	
	КонецЦикла;
		Если ПлюсНеВышедшиеИзЛОНачинаяС Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЛьготнаяОчередь.Период,
			|	ЛьготнаяОчередь.ПЗ,
			|	ЛьготнаяОчередь.ПЗ.Дата КАК ДатаСоздания,
			|	ЛьготнаяОчередь.Линейка,
			|	ЛьготнаяОчередь.Изделие,
			|	ЛьготнаяОчередь.НормаРасходов.Элемент КАК МПЗ,
			|	ЛьготнаяОчередь.ДатаОкончания
			|ИЗ
			|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
			|ГДЕ
			|	ЛьготнаяОчередь.Период МЕЖДУ &ДатаНач И &ДатаКон
			|	И ЛьготнаяОчередь.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
			Если СписокЛинеек.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И ЛьготнаяОчередь.Линейка В(&СписокЛинеек)";
			Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);	
			КонецЕсли;
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаНевышедших));	
		Запрос.УстановитьПараметр("ДатаКон",НачалоДня(Отчет.Период.ДатаНачала)-1);		
		Результат = Запрос.Выполнить();
		ВыборкаЛО = Результат.Выбрать();
			Пока ВыборкаЛО.Следующий() Цикл
			ТЧ = ТаблицаЛО.Добавить();
			ТЧ.ПЗ = ВыборкаЛО.ПЗ;
			ТЧ.ДатаСоздания = ВыборкаЛО.ДатаСоздания;
			ТЧ.Линейка = ВыборкаЛО.Линейка;
			ТЧ.Изделие = ВыборкаЛО.Изделие;
			ТЧ.МПЗ = ВыборкаЛО.МПЗ;
			ТЧ.Период = ВыборкаЛО.Период;
			ТЧ.НаименованиеИзделия = глНаименованиеВСкобкахБезЭтапа(ВыборкаЛО.Изделие);
				Если ТипЗнч(ВыборкаЛО.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
				ТЧ.Подразделение = ВыборкаЛО.МПЗ.Канбан.Подразделение;
				Иначе
				ТЧ.Подразделение = Справочники.Подразделения.НайтиПоКоду("32");
				КонецЕсли;
			ТЧ.Количество = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ВыборкаЛО.Период,ВыборкаЛО.ПЗ.ДокументОснование);
			ТЧ.ДатаОкончания = ВыборкаЛО.ДатаОкончания;
			КонецЦикла;
		КонецЕсли; 
ТаблицаЛО.Свернуть("МПЗ,Подразделение","Количество");
	Если СортироватьПо = 1 Тогда
	ТаблицаЛО.Сортировать("МПЗ,Подразделение");	
	ИначеЕсли СортироватьПо = 2 Тогда
	ТаблицаЛО.Сортировать("МПЗ,Подразделение");
	ИначеЕсли СортироватьПо = 3 Тогда
	ТаблицаЛО.Сортировать("МПЗ,Подразделение");
	ИначеЕсли СортироватьПо = 4 Тогда
	ТаблицаЛО.Сортировать("Подразделение,МПЗ");
	ИначеЕсли СортироватьПо = 5 Тогда
	ТаблицаЛО.Сортировать("МПЗ,Подразделение");
	ИначеЕсли СортироватьПо = 6 Тогда
	ТаблицаЛО.Сортировать("МПЗ,Подразделение");
	ИначеЕсли СортироватьПо = 7 Тогда
	ТаблицаЛО.Сортировать("МПЗ,Подразделение");
	КонецЕсли; 
		Для каждого ТЧ Из ТаблицаЛО Цикл 
			Если СписокПодразделений.Количество() > 0 Тогда
				Если СписокПодразделений.НайтиПоЗначению(ТЧ.Подразделение) = Неопределено Тогда
				Продолжить;
				КонецЕсли; 
			КонецЕсли;
		ОблСтрока.Параметры.НаименованиеМПЗ = СокрЛП(ТЧ.МПЗ.Наименование);
		ОблСтрока.Параметры.МПЗ = ТЧ.МПЗ;
		ОблСтрока.Параметры.КолНезав = ТЧ.Количество;
		ОблСтрока.Параметры.Подразделение = ТЧ.Подразделение;
		ТабДок.Вывести(ОблСтрока);
		КонецЦикла;	
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 4;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если БезРазбивкиПоЛинейкам Тогда
	СформироватьБезРазбивкиПоЛинейкамНаСервере();
	Иначе	
	СформироватьНаСервере();	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
ДатаНевышедших = Отчет.Период.ДатаНачала - 86400*30;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Отчет.Период.ДатаНачала) Тогда
	ДатаНевышедших = Отчет.Период.ДатаНачала - 86400*30;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ПлюсНеВышедшиеИзЛОНачинаяС = Истина;
КонецПроцедуры
